tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
    __IO uint32_t RBBAR0;                            /**< Rx BDR 0 base address register 0..Rx BDR 9 base address register 0, array offset: 0x8110, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBBAR1;                            /**< Rx BDR 0 base address register 1..Rx BDR 9 base address register 1, array offset: 0x8114, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBPIR;                             /**< Rx BDR 0 producer index register..Rx BDR 9 producer index register, array offset: 0x8118, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_3[4];
    __IO uint32_t RBLENR;                            /**< Rx BDR 0 length register..Rx BDR 9 length register, array offset: 0x8120, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_4[92];
    __I  uint32_t RBDCR;                             /**< Rx BDR 0 drop count register..Rx BDR 9 drop count register, array offset: 0x8180, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_5[28];
    __IO uint32_t RBIER;                             /**< Rx BDR 0 interrupt enable register..Rx BDR 9 interrupt enable register, array offset: 0x81A0, array step: 0x200, irregular array, not all indices are valid */
    __I  uint32_t RBIDR;                             /**< Rx BDR 0 interrupt detect register..Rx BDR 9 interrupt detect register, array offset: 0x81A4, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBICR0;                            /**< Rx BDR 0 interrupt coalescing register 0..Rx BDR 9 interrupt coalescing register 0, array offset: 0x81A8, array step: 0x200, irregular array, not all indices are valid */
    __IO uint32_t RBICR1;                            /**< Rx BDR 0 interrupt coalescing register 1..Rx BDR 9 interrupt coalescing register 1, array offset: 0x81AC, array step: 0x200, irregular array, not all indices are valid */
         uint8_t RESERVED_6[80];
  } BDR[ENETC_SI_BDR_COUNT];
} ENETC_SI_Type;

/* ----------------------------------------------------------------------------
   -- ENETC_SI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_SI_Register_Masks ENETC_SI Register Masks
 * @{
 */

/*! @name SIMR - Station interface mode register */
/*! @{ */

#define ENETC_SI_SIMR_RSSE_MASK                  (0x1U)
#define ENETC_SI_SIMR_RSSE_SHIFT                 (0U)
#define ENETC_SI_SIMR_RSSE(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RSSE_SHIFT)) & ENETC_SI_SIMR_RSSE_MASK)

#define ENETC_SI_SIMR_RNUM_MASK                  (0x2U)
#define ENETC_SI_SIMR_RNUM_SHIFT                 (1U)
#define ENETC_SI_SIMR_RNUM(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RNUM_SHIFT)) & ENETC_SI_SIMR_RNUM_MASK)

#define ENETC_SI_SIMR_RNMM_MASK                  (0x4U)
#define ENETC_SI_SIMR_RNMM_SHIFT                 (2U)
#define ENETC_SI_SIMR_RNMM(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RNMM_SHIFT)) & ENETC_SI_SIMR_RNMM_MASK)

#define ENETC_SI_SIMR_RNBM_MASK                  (0x8U)
#define ENETC_SI_SIMR_RNBM_SHIFT                 (3U)
#define ENETC_SI_SIMR_RNBM(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_RNBM_SHIFT)) & ENETC_SI_SIMR_RNBM_MASK)

#define ENETC_SI_SIMR_V2IPVE_MASK                (0x10U)
#define ENETC_SI_SIMR_V2IPVE_SHIFT               (4U)
#define ENETC_SI_SIMR_V2IPVE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_V2IPVE_SHIFT)) & ENETC_SI_SIMR_V2IPVE_MASK)

#define ENETC_SI_SIMR_DEFAULT_RX_GROUP_MASK      (0x10000U)
#define ENETC_SI_SIMR_DEFAULT_RX_GROUP_SHIFT     (16U)
#define ENETC_SI_SIMR_DEFAULT_RX_GROUP(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_DEFAULT_RX_GROUP_SHIFT)) & ENETC_SI_SIMR_DEFAULT_RX_GROUP_MASK)

#define ENETC_SI_SIMR_EN_MASK                    (0x80000000U)
#define ENETC_SI_SIMR_EN_SHIFT                   (31U)
#define ENETC_SI_SIMR_EN(x)                      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMR_EN_SHIFT)) & ENETC_SI_SIMR_EN_MASK)
/*! @} */

/*! @name SISR - Station interface status register */
/*! @{ */

#define ENETC_SI_SISR_TX_BUSY_MASK               (0x1U)
#define ENETC_SI_SISR_TX_BUSY_SHIFT              (0U)
#define ENETC_SI_SISR_TX_BUSY(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_TX_BUSY_SHIFT)) & ENETC_SI_SISR_TX_BUSY_MASK)

#define ENETC_SI_SISR_MAC_UP_MASK                (0x2U)
#define ENETC_SI_SISR_MAC_UP_SHIFT               (1U)
#define ENETC_SI_SISR_MAC_UP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_MAC_UP_SHIFT)) & ENETC_SI_SISR_MAC_UP_MASK)

#define ENETC_SI_SISR_MAC_MP_MASK                (0x4U)
#define ENETC_SI_SISR_MAC_MP_SHIFT               (2U)
#define ENETC_SI_SISR_MAC_MP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_MAC_MP_SHIFT)) & ENETC_SI_SISR_MAC_MP_MASK)

#define ENETC_SI_SISR_VLAN_P_MASK                (0x8U)
#define ENETC_SI_SISR_VLAN_P_SHIFT               (3U)
#define ENETC_SI_SISR_VLAN_P(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_VLAN_P_SHIFT)) & ENETC_SI_SISR_VLAN_P_MASK)

#define ENETC_SI_SISR_VLAN_UTA_MASK              (0x10U)
#define ENETC_SI_SISR_VLAN_UTA_SHIFT             (4U)
#define ENETC_SI_SISR_VLAN_UTA(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SISR_VLAN_UTA_SHIFT)) & ENETC_SI_SISR_VLAN_UTA_MASK)
/*! @} */

/*! @name SICTR - Station interface current time register 0..Station interface current time register 1 */
/*! @{ */

#define ENETC_SI_SICTR_CURR_TIME_MASK            (0xFFFFFFFFU)
#define ENETC_SI_SICTR_CURR_TIME_SHIFT           (0U)
#define ENETC_SI_SICTR_CURR_TIME(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICTR_CURR_TIME_SHIFT)) & ENETC_SI_SICTR_CURR_TIME_MASK)
/*! @} */

/*! @name SIPCAPR0 - Station interface port capability register 0 */
/*! @{ */

