tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SIPCAPR0_RFS_MASK               (0x4U)
#define ENETC_SI_SIPCAPR0_RFS_SHIFT              (2U)
/*! RFS - Receive Flow Steering
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_RFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_RFS_SHIFT)) & ENETC_SI_SIPCAPR0_RFS_MASK)

#define ENETC_SI_SIPCAPR0_FP_MASK                (0x8U)
#define ENETC_SI_SIPCAPR0_FP_SHIFT               (3U)
/*! FP - Frame Preemption
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_FP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_FP_SHIFT)) & ENETC_SI_SIPCAPR0_FP_MASK)

#define ENETC_SI_SIPCAPR0_TGS_MASK               (0x10U)
#define ENETC_SI_SIPCAPR0_TGS_SHIFT              (4U)
/*! TGS - Time Gate Scheduling
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_TGS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_TGS_SHIFT)) & ENETC_SI_SIPCAPR0_TGS_MASK)

#define ENETC_SI_SIPCAPR0_TSD_MASK               (0x20U)
#define ENETC_SI_SIPCAPR0_TSD_SHIFT              (5U)
/*! TSD - Time Specific Departure
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_TSD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_TSD_SHIFT)) & ENETC_SI_SIPCAPR0_TSD_MASK)

#define ENETC_SI_SIPCAPR0_CBS_MASK               (0x40U)
#define ENETC_SI_SIPCAPR0_CBS_SHIFT              (6U)
/*! CBS - Credit Based Shaping (CBS)
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_CBS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_CBS_SHIFT)) & ENETC_SI_SIPCAPR0_CBS_MASK)

#define ENETC_SI_SIPCAPR0_RSS_MASK               (0x100U)
#define ENETC_SI_SIPCAPR0_RSS_SHIFT              (8U)
/*! RSS - Receive Side Scaling
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_RSS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_RSS_SHIFT)) & ENETC_SI_SIPCAPR0_RSS_MASK)

#define ENETC_SI_SIPCAPR0_PSFP_MASK              (0x200U)
#define ENETC_SI_SIPCAPR0_PSFP_SHIFT             (9U)
/*! PSFP - Per-Stream Filtering and Policing (IEEE 802.1Qci)
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_PSFP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_PSFP_SHIFT)) & ENETC_SI_SIPCAPR0_PSFP_MASK)

#define ENETC_SI_SIPCAPR0_IPFLT_MASK             (0x400U)
#define ENETC_SI_SIPCAPR0_IPFLT_SHIFT            (10U)
/*! IPFLT - Ingress Port Filtering
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_IPFLT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_IPFLT_SHIFT)) & ENETC_SI_SIPCAPR0_IPFLT_MASK)

#define ENETC_SI_SIPCAPR0_RP_MASK                (0x800U)
#define ENETC_SI_SIPCAPR0_RP_SHIFT               (11U)
/*! RP - Rate Policing
 *  0b0..Not Supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_RP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_RP_SHIFT)) & ENETC_SI_SIPCAPR0_RP_MASK)

#define ENETC_SI_SIPCAPR0_WO_MASK                (0x2000U)
#define ENETC_SI_SIPCAPR0_WO_SHIFT               (13U)
/*! WO - Wake-on-LAN
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_WO(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_WO_SHIFT)) & ENETC_SI_SIPCAPR0_WO_MASK)

#define ENETC_SI_SIPCAPR0_FS_MASK                (0x10000U)
#define ENETC_SI_SIPCAPR0_FS_SHIFT               (16U)
/*! FS - Functional Safety
 *  0b0..Not supported
 *  0b1..Supported
 */
#define ENETC_SI_SIPCAPR0_FS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR0_FS_SHIFT)) & ENETC_SI_SIPCAPR0_FS_MASK)
/*! @} */

/*! @name SIPCAPR1 - Station interface port capability register 1 */
/*! @{ */

#define ENETC_SI_SIPCAPR1_NUM_TCS_MASK           (0x70U)
#define ENETC_SI_SIPCAPR1_NUM_TCS_SHIFT          (4U)
#define ENETC_SI_SIPCAPR1_NUM_TCS(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_TCS_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_TCS_MASK)

#define ENETC_SI_SIPCAPR1_NUM_MCH_MASK           (0x300U)
#define ENETC_SI_SIPCAPR1_NUM_MCH_SHIFT          (8U)
#define ENETC_SI_SIPCAPR1_NUM_MCH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_MCH_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_MCH_MASK)

#define ENETC_SI_SIPCAPR1_NUM_UCH_MASK           (0xC00U)
#define ENETC_SI_SIPCAPR1_NUM_UCH_SHIFT          (10U)
#define ENETC_SI_SIPCAPR1_NUM_UCH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_UCH_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_UCH_MASK)

#define ENETC_SI_SIPCAPR1_NUM_MSIX_MASK          (0x3F000U)
#define ENETC_SI_SIPCAPR1_NUM_MSIX_SHIFT         (12U)
#define ENETC_SI_SIPCAPR1_NUM_MSIX(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_MSIX_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_MSIX_MASK)

#define ENETC_SI_SIPCAPR1_NUM_IPV_MASK           (0x80000000U)
#define ENETC_SI_SIPCAPR1_NUM_IPV_SHIFT          (31U)
#define ENETC_SI_SIPCAPR1_NUM_IPV(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_IPV_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_IPV_MASK)
/*! @} */

/*! @name SITSR - Station interface timer status register */
/*! @{ */

#define ENETC_SI_SITSR_SYNC_MASK                 (0x1U)
#define ENETC_SI_SITSR_SYNC_SHIFT                (0U)
/*! SYNC - Timer synchronization */
#define ENETC_SI_SITSR_SYNC(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITSR_SYNC_SHIFT)) & ENETC_SI_SITSR_SYNC_MASK)

#define ENETC_SI_SITSR_PARAM_VAL_MASK            (0xFFFFFFFEU)
#define ENETC_SI_SITSR_PARAM_VAL_SHIFT           (1U)
/*! PARAM_VAL - User specific parameter values */
#define ENETC_SI_SITSR_PARAM_VAL(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITSR_PARAM_VAL_SHIFT)) & ENETC_SI_SITSR_PARAM_VAL_MASK)
/*! @} */

/*! @name SIRBGCR - Station interface receive BDR group control register */
/*! @{ */

#define ENETC_SI_SIRBGCR_NUM_GROUPS_MASK         (0x3U)
#define ENETC_SI_SIRBGCR_NUM_GROUPS_SHIFT        (0U)
#define ENETC_SI_SIRBGCR_NUM_GROUPS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRBGCR_NUM_GROUPS_SHIFT)) & ENETC_SI_SIRBGCR_NUM_GROUPS_MASK)

