tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SIRBGCR_RINGS_PER_GROUP_MASK    (0x70000U)
#define ENETC_SI_SIRBGCR_RINGS_PER_GROUP_SHIFT   (16U)
#define ENETC_SI_SIRBGCR_RINGS_PER_GROUP(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRBGCR_RINGS_PER_GROUP_SHIFT)) & ENETC_SI_SIRBGCR_RINGS_PER_GROUP_MASK)
/*! @} */

/*! @name SIBCAR - Station interface buffer cache attribute register */
/*! @{ */

#define ENETC_SI_SIBCAR_BD_WRCACHE_MASK          (0xFU)
#define ENETC_SI_SIBCAR_BD_WRCACHE_SHIFT         (0U)
#define ENETC_SI_SIBCAR_BD_WRCACHE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_WRCACHE_SHIFT)) & ENETC_SI_SIBCAR_BD_WRCACHE_MASK)

#define ENETC_SI_SIBCAR_BD_WRDOMAIN_MASK         (0x30U)
#define ENETC_SI_SIBCAR_BD_WRDOMAIN_SHIFT        (4U)
#define ENETC_SI_SIBCAR_BD_WRDOMAIN(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_WRDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_BD_WRDOMAIN_MASK)

#define ENETC_SI_SIBCAR_BD_WRSNP_MASK            (0x40U)
#define ENETC_SI_SIBCAR_BD_WRSNP_SHIFT           (6U)
#define ENETC_SI_SIBCAR_BD_WRSNP(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_WRSNP_SHIFT)) & ENETC_SI_SIBCAR_BD_WRSNP_MASK)

#define ENETC_SI_SIBCAR_WRCACHE_MASK             (0xF00U)
#define ENETC_SI_SIBCAR_WRCACHE_SHIFT            (8U)
#define ENETC_SI_SIBCAR_WRCACHE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_WRCACHE_SHIFT)) & ENETC_SI_SIBCAR_WRCACHE_MASK)

#define ENETC_SI_SIBCAR_WRDOMAIN_MASK            (0x3000U)
#define ENETC_SI_SIBCAR_WRDOMAIN_SHIFT           (12U)
#define ENETC_SI_SIBCAR_WRDOMAIN(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_WRDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_WRDOMAIN_MASK)

#define ENETC_SI_SIBCAR_WRSNP_MASK               (0x4000U)
#define ENETC_SI_SIBCAR_WRSNP_SHIFT              (14U)
#define ENETC_SI_SIBCAR_WRSNP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_WRSNP_SHIFT)) & ENETC_SI_SIBCAR_WRSNP_MASK)

#define ENETC_SI_SIBCAR_BD_RDCACHE_MASK          (0xF0000U)
#define ENETC_SI_SIBCAR_BD_RDCACHE_SHIFT         (16U)
#define ENETC_SI_SIBCAR_BD_RDCACHE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_RDCACHE_SHIFT)) & ENETC_SI_SIBCAR_BD_RDCACHE_MASK)

#define ENETC_SI_SIBCAR_BD_RDDOMAIN_MASK         (0x300000U)
#define ENETC_SI_SIBCAR_BD_RDDOMAIN_SHIFT        (20U)
#define ENETC_SI_SIBCAR_BD_RDDOMAIN(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_RDDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_BD_RDDOMAIN_MASK)

#define ENETC_SI_SIBCAR_BD_RDSNP_MASK            (0x400000U)
#define ENETC_SI_SIBCAR_BD_RDSNP_SHIFT           (22U)
#define ENETC_SI_SIBCAR_BD_RDSNP(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_RDSNP_SHIFT)) & ENETC_SI_SIBCAR_BD_RDSNP_MASK)

#define ENETC_SI_SIBCAR_RDCACHE_MASK             (0xF000000U)
#define ENETC_SI_SIBCAR_RDCACHE_SHIFT            (24U)
#define ENETC_SI_SIBCAR_RDCACHE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_RDCACHE_SHIFT)) & ENETC_SI_SIBCAR_RDCACHE_MASK)

#define ENETC_SI_SIBCAR_RDDOMAIN_MASK            (0x30000000U)
#define ENETC_SI_SIBCAR_RDDOMAIN_SHIFT           (28U)
#define ENETC_SI_SIBCAR_RDDOMAIN(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_RDDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_RDDOMAIN_MASK)

#define ENETC_SI_SIBCAR_RDSNP_MASK               (0x40000000U)
#define ENETC_SI_SIBCAR_RDSNP_SHIFT              (30U)
#define ENETC_SI_SIBCAR_RDSNP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_RDSNP_SHIFT)) & ENETC_SI_SIBCAR_RDSNP_MASK)
/*! @} */

/*! @name SIMCAR - Station interface message cache attribute register */
/*! @{ */

#define ENETC_SI_SIMCAR_MSG_WRCACHE_MASK         (0xFU)
#define ENETC_SI_SIMCAR_MSG_WRCACHE_SHIFT        (0U)
#define ENETC_SI_SIMCAR_MSG_WRCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_WRCACHE_SHIFT)) & ENETC_SI_SIMCAR_MSG_WRCACHE_MASK)

#define ENETC_SI_SIMCAR_MSG_WRDOMAIN_MASK        (0x30U)
#define ENETC_SI_SIMCAR_MSG_WRDOMAIN_SHIFT       (4U)
#define ENETC_SI_SIMCAR_MSG_WRDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_WRDOMAIN_SHIFT)) & ENETC_SI_SIMCAR_MSG_WRDOMAIN_MASK)

#define ENETC_SI_SIMCAR_MSG_WRSNP_MASK           (0x40U)
#define ENETC_SI_SIMCAR_MSG_WRSNP_SHIFT          (6U)
#define ENETC_SI_SIMCAR_MSG_WRSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_WRSNP_SHIFT)) & ENETC_SI_SIMCAR_MSG_WRSNP_MASK)

#define ENETC_SI_SIMCAR_MSG_RDCACHE_MASK         (0xF0000U)
#define ENETC_SI_SIMCAR_MSG_RDCACHE_SHIFT        (16U)
#define ENETC_SI_SIMCAR_MSG_RDCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_RDCACHE_SHIFT)) & ENETC_SI_SIMCAR_MSG_RDCACHE_MASK)

#define ENETC_SI_SIMCAR_MSG_RDDOMAIN_MASK        (0x300000U)
#define ENETC_SI_SIMCAR_MSG_RDDOMAIN_SHIFT       (20U)
#define ENETC_SI_SIMCAR_MSG_RDDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_RDDOMAIN_SHIFT)) & ENETC_SI_SIMCAR_MSG_RDDOMAIN_MASK)

#define ENETC_SI_SIMCAR_MSG_RDSNP_MASK           (0x400000U)
#define ENETC_SI_SIMCAR_MSG_RDSNP_SHIFT          (22U)
#define ENETC_SI_SIMCAR_MSG_RDSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_RDSNP_SHIFT)) & ENETC_SI_SIMCAR_MSG_RDSNP_MASK)
/*! @} */

/*! @name SICCAR - Station interface command cache attribute register */
/*! @{ */

#define ENETC_SI_SICCAR_CBD_WRCACHE_MASK         (0xFU)
#define ENETC_SI_SICCAR_CBD_WRCACHE_SHIFT        (0U)
#define ENETC_SI_SICCAR_CBD_WRCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CBD_WRCACHE_SHIFT)) & ENETC_SI_SICCAR_CBD_WRCACHE_MASK)

#define ENETC_SI_SICCAR_CBD_WRDOMAIN_MASK        (0x30U)
#define ENETC_SI_SICCAR_CBD_WRDOMAIN_SHIFT       (4U)
#define ENETC_SI_SICCAR_CBD_WRDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CBD_WRDOMAIN_SHIFT)) & ENETC_SI_SICCAR_CBD_WRDOMAIN_MASK)

#define ENETC_SI_SICCAR_CBD_WRSNP_MASK           (0x40U)
#define ENETC_SI_SICCAR_CBD_WRSNP_SHIFT          (6U)
#define ENETC_SI_SICCAR_CBD_WRSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CBD_WRSNP_SHIFT)) & ENETC_SI_SICCAR_CBD_WRSNP_MASK)

