tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SICCAR_CWRCACHE_MASK            (0xF00U)
#define ENETC_SI_SICCAR_CWRCACHE_SHIFT           (8U)
#define ENETC_SI_SICCAR_CWRCACHE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CWRCACHE_SHIFT)) & ENETC_SI_SICCAR_CWRCACHE_MASK)

#define ENETC_SI_SICCAR_CWRDOMAIN_MASK           (0x3000U)
#define ENETC_SI_SICCAR_CWRDOMAIN_SHIFT          (12U)
#define ENETC_SI_SICCAR_CWRDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CWRDOMAIN_SHIFT)) & ENETC_SI_SICCAR_CWRDOMAIN_MASK)

#define ENETC_SI_SICCAR_CWRSNP_MASK              (0x4000U)
#define ENETC_SI_SICCAR_CWRSNP_SHIFT             (14U)
#define ENETC_SI_SICCAR_CWRSNP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CWRSNP_SHIFT)) & ENETC_SI_SICCAR_CWRSNP_MASK)

#define ENETC_SI_SICCAR_CBD_RDCACHE_MASK         (0xF0000U)
#define ENETC_SI_SICCAR_CBD_RDCACHE_SHIFT        (16U)
#define ENETC_SI_SICCAR_CBD_RDCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CBD_RDCACHE_SHIFT)) & ENETC_SI_SICCAR_CBD_RDCACHE_MASK)

#define ENETC_SI_SICCAR_CBD_RDDOMAIN_MASK        (0x300000U)
#define ENETC_SI_SICCAR_CBD_RDDOMAIN_SHIFT       (20U)
#define ENETC_SI_SICCAR_CBD_RDDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CBD_RDDOMAIN_SHIFT)) & ENETC_SI_SICCAR_CBD_RDDOMAIN_MASK)

#define ENETC_SI_SICCAR_CBD_RDSNP_MASK           (0x400000U)
#define ENETC_SI_SICCAR_CBD_RDSNP_SHIFT          (22U)
#define ENETC_SI_SICCAR_CBD_RDSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CBD_RDSNP_SHIFT)) & ENETC_SI_SICCAR_CBD_RDSNP_MASK)

#define ENETC_SI_SICCAR_CRDCACHE_MASK            (0xF000000U)
#define ENETC_SI_SICCAR_CRDCACHE_SHIFT           (24U)
#define ENETC_SI_SICCAR_CRDCACHE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CRDCACHE_SHIFT)) & ENETC_SI_SICCAR_CRDCACHE_MASK)

#define ENETC_SI_SICCAR_CRDDOMAIN_MASK           (0x30000000U)
#define ENETC_SI_SICCAR_CRDDOMAIN_SHIFT          (28U)
#define ENETC_SI_SICCAR_CRDDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CRDDOMAIN_SHIFT)) & ENETC_SI_SICCAR_CRDDOMAIN_MASK)

#define ENETC_SI_SICCAR_CRDSNP_MASK              (0x40000000U)
#define ENETC_SI_SICCAR_CRDSNP_SHIFT             (30U)
#define ENETC_SI_SICCAR_CRDSNP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICCAR_CRDSNP_SHIFT)) & ENETC_SI_SICCAR_CRDSNP_MASK)
/*! @} */

/*! @name SIPMAR0 - Station interface primary MAC address register 0 */
/*! @{ */

#define ENETC_SI_SIPMAR0_PRIM_MAC_ADDR_MASK      (0xFFFFFFFFU)
#define ENETC_SI_SIPMAR0_PRIM_MAC_ADDR_SHIFT     (0U)
#define ENETC_SI_SIPMAR0_PRIM_MAC_ADDR(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPMAR0_PRIM_MAC_ADDR_SHIFT)) & ENETC_SI_SIPMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name SIPMAR1 - Station interface primary MAC address register 1 */
/*! @{ */

#define ENETC_SI_SIPMAR1_PRIM_MAC_ADDR_MASK      (0xFFFFU)
#define ENETC_SI_SIPMAR1_PRIM_MAC_ADDR_SHIFT     (0U)
#define ENETC_SI_SIPMAR1_PRIM_MAC_ADDR(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPMAR1_PRIM_MAC_ADDR_SHIFT)) & ENETC_SI_SIPMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name SICVLANR1 - Station interface custom VLAN register 1 */
/*! @{ */

#define ENETC_SI_SICVLANR1_ETYPE_MASK            (0xFFFFU)
#define ENETC_SI_SICVLANR1_ETYPE_SHIFT           (0U)
#define ENETC_SI_SICVLANR1_ETYPE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICVLANR1_ETYPE_SHIFT)) & ENETC_SI_SICVLANR1_ETYPE_MASK)

#define ENETC_SI_SICVLANR1_V_MASK                (0x80000000U)
#define ENETC_SI_SICVLANR1_V_SHIFT               (31U)
#define ENETC_SI_SICVLANR1_V(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICVLANR1_V_SHIFT)) & ENETC_SI_SICVLANR1_V_MASK)
/*! @} */

/*! @name SICVLANR2 - Station interface custom VLAN register 2 */
/*! @{ */

#define ENETC_SI_SICVLANR2_ETYPE_MASK            (0xFFFFU)
#define ENETC_SI_SICVLANR2_ETYPE_SHIFT           (0U)
#define ENETC_SI_SICVLANR2_ETYPE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICVLANR2_ETYPE_SHIFT)) & ENETC_SI_SICVLANR2_ETYPE_MASK)

#define ENETC_SI_SICVLANR2_V_MASK                (0x80000000U)
#define ENETC_SI_SICVLANR2_V_SHIFT               (31U)
#define ENETC_SI_SICVLANR2_V(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICVLANR2_V_SHIFT)) & ENETC_SI_SICVLANR2_V_MASK)
/*! @} */

/*! @name SIVLANIPVMR0 - Station interface VLAN to IPV mapping register 0 */
/*! @{ */

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_MASK     (0xFU)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_SHIFT    (0U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_0(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_MASK     (0xF0U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_SHIFT    (4U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_1(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_MASK     (0xF00U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_SHIFT    (8U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_2(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_MASK     (0xF000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_SHIFT    (12U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_3(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_MASK     (0xF0000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_SHIFT    (16U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_4(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_MASK     (0xF00000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_SHIFT    (20U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_5(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_MASK     (0xF000000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_SHIFT    (24U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_6(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_MASK     (0xF0000000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_SHIFT    (28U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_7(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_MASK)
/*! @} */

/*! @name SIVLANIPVMR1 - Station interface VLAN to IPV mapping register 1 */
/*! @{ */

