tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_MASK     (0xFU)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_SHIFT    (0U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_8(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_MASK     (0xF0U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_SHIFT    (4U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_9(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_MASK    (0xF00U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_SHIFT   (8U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_10(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_MASK    (0xF000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_SHIFT   (12U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_11(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_MASK    (0xF0000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_SHIFT   (16U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_12(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_MASK    (0xF00000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_SHIFT   (20U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_13(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_MASK    (0xF000000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_SHIFT   (24U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_14(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_MASK    (0xF0000000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_SHIFT   (28U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_15(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_MASK)
/*! @} */

/*! @name SIIPVBDRMR0 - Station interface IPV to ring mapping register */
/*! @{ */

#define ENETC_SI_SIIPVBDRMR0_IPV0BDR_MASK        (0x7U)
#define ENETC_SI_SIIPVBDRMR0_IPV0BDR_SHIFT       (0U)
#define ENETC_SI_SIIPVBDRMR0_IPV0BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV0BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV0BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV1BDR_MASK        (0x70U)
#define ENETC_SI_SIIPVBDRMR0_IPV1BDR_SHIFT       (4U)
#define ENETC_SI_SIIPVBDRMR0_IPV1BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV1BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV1BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV2BDR_MASK        (0x700U)
#define ENETC_SI_SIIPVBDRMR0_IPV2BDR_SHIFT       (8U)
#define ENETC_SI_SIIPVBDRMR0_IPV2BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV2BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV2BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV3BDR_MASK        (0x7000U)
#define ENETC_SI_SIIPVBDRMR0_IPV3BDR_SHIFT       (12U)
#define ENETC_SI_SIIPVBDRMR0_IPV3BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV3BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV3BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV4BDR_MASK        (0x70000U)
#define ENETC_SI_SIIPVBDRMR0_IPV4BDR_SHIFT       (16U)
#define ENETC_SI_SIIPVBDRMR0_IPV4BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV4BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV4BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV5BDR_MASK        (0x700000U)
#define ENETC_SI_SIIPVBDRMR0_IPV5BDR_SHIFT       (20U)
#define ENETC_SI_SIIPVBDRMR0_IPV5BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV5BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV5BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV6BDR_MASK        (0x7000000U)
#define ENETC_SI_SIIPVBDRMR0_IPV6BDR_SHIFT       (24U)
#define ENETC_SI_SIIPVBDRMR0_IPV6BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV6BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV6BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV7BDR_MASK        (0x70000000U)
#define ENETC_SI_SIIPVBDRMR0_IPV7BDR_SHIFT       (28U)
#define ENETC_SI_SIIPVBDRMR0_IPV7BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV7BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV7BDR_MASK)
/*! @} */

/*! @name PSIMSGRR - Physical station interface message receive register */
/*! @{ */

#define ENETC_SI_PSIMSGRR_MR1_MASK               (0x2U)
#define ENETC_SI_PSIMSGRR_MR1_SHIFT              (1U)
#define ENETC_SI_PSIMSGRR_MR1(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIMSGRR_MR1_SHIFT)) & ENETC_SI_PSIMSGRR_MR1_MASK)

#define ENETC_SI_PSIMSGRR_MC_MASK                (0xFFFF0000U)
#define ENETC_SI_PSIMSGRR_MC_SHIFT               (16U)
/*! MC - Message code */
#define ENETC_SI_PSIMSGRR_MC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIMSGRR_MC_SHIFT)) & ENETC_SI_PSIMSGRR_MC_MASK)
/*! @} */

/*! @name PSIMSGSR - Physical station interface message send register */
/*! @{ */

#define ENETC_SI_PSIMSGSR_MS1_MASK               (0x2U)
#define ENETC_SI_PSIMSGSR_MS1_SHIFT              (1U)
#define ENETC_SI_PSIMSGSR_MS1(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIMSGSR_MS1_SHIFT)) & ENETC_SI_PSIMSGSR_MS1_MASK)

#define ENETC_SI_PSIMSGSR_MC_MASK                (0xFFFF0000U)
#define ENETC_SI_PSIMSGSR_MC_SHIFT               (16U)
#define ENETC_SI_PSIMSGSR_MC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIMSGSR_MC_SHIFT)) & ENETC_SI_PSIMSGSR_MC_MASK)
/*! @} */

/*! @name PSIVMSGRCVAR0 - PSI VSI 1 message receive address register 0 */
/*! @{ */

#define ENETC_SI_PSIVMSGRCVAR0_MSIZE_MASK        (0x1FU)
#define ENETC_SI_PSIVMSGRCVAR0_MSIZE_SHIFT       (0U)
#define ENETC_SI_PSIVMSGRCVAR0_MSIZE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIVMSGRCVAR0_MSIZE_SHIFT)) & ENETC_SI_PSIVMSGRCVAR0_MSIZE_MASK)

#define ENETC_SI_PSIVMSGRCVAR0_ADDRL_MASK        (0xFFFFFFC0U)
#define ENETC_SI_PSIVMSGRCVAR0_ADDRL_SHIFT       (6U)
#define ENETC_SI_PSIVMSGRCVAR0_ADDRL(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIVMSGRCVAR0_ADDRL_SHIFT)) & ENETC_SI_PSIVMSGRCVAR0_ADDRL_MASK)
/*! @} */

/* The count of ENETC_SI_PSIVMSGRCVAR0 */
#define ENETC_SI_PSIVMSGRCVAR0_COUNT             (1U)

/*! @name PSIVMSGRCVAR1 - PSI VSI 1 message receive address register 1 */
/*! @{ */

