tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_PSIVMSGRCVAR1_ADDRH_MASK        (0xFFFFFFFFU)
#define ENETC_SI_PSIVMSGRCVAR1_ADDRH_SHIFT       (0U)
#define ENETC_SI_PSIVMSGRCVAR1_ADDRH(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIVMSGRCVAR1_ADDRH_SHIFT)) & ENETC_SI_PSIVMSGRCVAR1_ADDRH_MASK)
/*! @} */

/* The count of ENETC_SI_PSIVMSGRCVAR1 */
#define ENETC_SI_PSIVMSGRCVAR1_COUNT             (1U)

/*! @name VSIMSGSR - Virtual station interface message send register */
/*! @{ */

#define ENETC_SI_VSIMSGSR_MB_MASK                (0x1U)
#define ENETC_SI_VSIMSGSR_MB_SHIFT               (0U)
#define ENETC_SI_VSIMSGSR_MB(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGSR_MB_SHIFT)) & ENETC_SI_VSIMSGSR_MB_MASK)

#define ENETC_SI_VSIMSGSR_MS_MASK                (0x2U)
#define ENETC_SI_VSIMSGSR_MS_SHIFT               (1U)
#define ENETC_SI_VSIMSGSR_MS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGSR_MS_SHIFT)) & ENETC_SI_VSIMSGSR_MS_MASK)

#define ENETC_SI_VSIMSGSR_MC_MASK                (0xFFFF0000U)
#define ENETC_SI_VSIMSGSR_MC_SHIFT               (16U)
#define ENETC_SI_VSIMSGSR_MC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGSR_MC_SHIFT)) & ENETC_SI_VSIMSGSR_MC_MASK)
/*! @} */

/*! @name VSIMSGRR - Virtual station interface message receive register */
/*! @{ */

#define ENETC_SI_VSIMSGRR_MR_MASK                (0x1U)
#define ENETC_SI_VSIMSGRR_MR_SHIFT               (0U)
#define ENETC_SI_VSIMSGRR_MR(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGRR_MR_SHIFT)) & ENETC_SI_VSIMSGRR_MR_MASK)

#define ENETC_SI_VSIMSGRR_MC_MASK                (0xFFFF0000U)
#define ENETC_SI_VSIMSGRR_MC_SHIFT               (16U)
#define ENETC_SI_VSIMSGRR_MC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGRR_MC_SHIFT)) & ENETC_SI_VSIMSGRR_MC_MASK)
/*! @} */

/*! @name VSIMSGSNDAR0 - Virtual station interface message send register 0 */
/*! @{ */

#define ENETC_SI_VSIMSGSNDAR0_MSIZE_MASK         (0x1FU)
#define ENETC_SI_VSIMSGSNDAR0_MSIZE_SHIFT        (0U)
#define ENETC_SI_VSIMSGSNDAR0_MSIZE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGSNDAR0_MSIZE_SHIFT)) & ENETC_SI_VSIMSGSNDAR0_MSIZE_MASK)

#define ENETC_SI_VSIMSGSNDAR0_ADDRL_MASK         (0xFFFFFFC0U)
#define ENETC_SI_VSIMSGSNDAR0_ADDRL_SHIFT        (6U)
#define ENETC_SI_VSIMSGSNDAR0_ADDRL(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGSNDAR0_ADDRL_SHIFT)) & ENETC_SI_VSIMSGSNDAR0_ADDRL_MASK)
/*! @} */

/*! @name VSIMSGSNDAR1 - Virtual station interface message send address register 1 */
/*! @{ */

#define ENETC_SI_VSIMSGSNDAR1_ADDRH_MASK         (0xFFFFFFFFU)
#define ENETC_SI_VSIMSGSNDAR1_ADDRH_SHIFT        (0U)
#define ENETC_SI_VSIMSGSNDAR1_ADDRH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIMSGSNDAR1_ADDRH_SHIFT)) & ENETC_SI_VSIMSGSNDAR1_ADDRH_MASK)
/*! @} */

/*! @name SIROCT0 - Station interface receive octets counter (ifInOctets) 0 */
/*! @{ */

#define ENETC_SI_SIROCT0_ROCT_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIROCT0_ROCT_LOW_SHIFT          (0U)
#define ENETC_SI_SIROCT0_ROCT_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIROCT0_ROCT_LOW_SHIFT)) & ENETC_SI_SIROCT0_ROCT_LOW_MASK)
/*! @} */

/*! @name SIROCT1 - Station interface receive octets counter (ifInOctets) 1 */
/*! @{ */

#define ENETC_SI_SIROCT1_ROCT_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIROCT1_ROCT_HIGH_SHIFT         (0U)
#define ENETC_SI_SIROCT1_ROCT_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIROCT1_ROCT_HIGH_SHIFT)) & ENETC_SI_SIROCT1_ROCT_HIGH_MASK)
/*! @} */

/*! @name SIRFRM0 - Station interface receive frame counter (aFrameReceivedOK) 0 */
/*! @{ */

#define ENETC_SI_SIRFRM0_RFRM_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIRFRM0_RFRM_LOW_SHIFT          (0U)
#define ENETC_SI_SIRFRM0_RFRM_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRFRM0_RFRM_LOW_SHIFT)) & ENETC_SI_SIRFRM0_RFRM_LOW_MASK)
/*! @} */

/*! @name SIRFRM1 - Station interface receive frame counter (aFrameReceivedOK) 1 */
/*! @{ */

#define ENETC_SI_SIRFRM1_RFRM_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIRFRM1_RFRM_HIGH_SHIFT         (0U)
#define ENETC_SI_SIRFRM1_RFRM_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRFRM1_RFRM_HIGH_SHIFT)) & ENETC_SI_SIRFRM1_RFRM_HIGH_MASK)
/*! @} */

/*! @name SIRUCA0 - Station interface receive unicast frame counter (ifInUcastPkts) 0 */
/*! @{ */

#define ENETC_SI_SIRUCA0_RUCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIRUCA0_RUCA_LOW_SHIFT          (0U)
#define ENETC_SI_SIRUCA0_RUCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRUCA0_RUCA_LOW_SHIFT)) & ENETC_SI_SIRUCA0_RUCA_LOW_MASK)
/*! @} */

/*! @name SIRUCA1 - Station interface receive unicast frame counter (ifInUcastPkts) 1 */
/*! @{ */

#define ENETC_SI_SIRUCA1_RUCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIRUCA1_RUCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SIRUCA1_RUCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRUCA1_RUCA_HIGH_SHIFT)) & ENETC_SI_SIRUCA1_RUCA_HIGH_MASK)
/*! @} */

/*! @name SIRMCA0 - Station interface receive multicast frame counter (ifInMulticastPkts) 0 */
/*! @{ */

#define ENETC_SI_SIRMCA0_RMCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIRMCA0_RMCA_LOW_SHIFT          (0U)
#define ENETC_SI_SIRMCA0_RMCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRMCA0_RMCA_LOW_SHIFT)) & ENETC_SI_SIRMCA0_RMCA_LOW_MASK)
/*! @} */

/*! @name SIRMCA1 - Station interface receive multicast frame counter (ifInMulticastPkts) 1 */
/*! @{ */

#define ENETC_SI_SIRMCA1_RMCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SIRMCA1_RMCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SIRMCA1_RMCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRMCA1_RMCA_HIGH_SHIFT)) & ENETC_SI_SIRMCA1_RMCA_HIGH_MASK)
/*! @} */

/*! @name SITOCT0 - Station interface transmit octets counter (ifOutOctets) 0 */
/*! @{ */

#define ENETC_SI_SITOCT0_TOCT_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITOCT0_TOCT_LOW_SHIFT          (0U)
#define ENETC_SI_SITOCT0_TOCT_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITOCT0_TOCT_LOW_SHIFT)) & ENETC_SI_SITOCT0_TOCT_LOW_MASK)
/*! @} */

