tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
/*! @name SITOCT1 - Station interface transmit octets counter (ifOutOctets) 1 */
/*! @{ */

#define ENETC_SI_SITOCT1_TOCT_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITOCT1_TOCT_HIGH_SHIFT         (0U)
#define ENETC_SI_SITOCT1_TOCT_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITOCT1_TOCT_HIGH_SHIFT)) & ENETC_SI_SITOCT1_TOCT_HIGH_MASK)
/*! @} */

/*! @name SITFRM0 - Station interface transmit frame counter (aFrameTransmittedOK) 0 */
/*! @{ */

#define ENETC_SI_SITFRM0_TFRM_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITFRM0_TFRM_LOW_SHIFT          (0U)
#define ENETC_SI_SITFRM0_TFRM_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITFRM0_TFRM_LOW_SHIFT)) & ENETC_SI_SITFRM0_TFRM_LOW_MASK)
/*! @} */

/*! @name SITFRM1 - Station interface transmit frame counter (aFrameTransmittedOK) 1 */
/*! @{ */

#define ENETC_SI_SITFRM1_TFRM_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITFRM1_TFRM_HIGH_SHIFT         (0U)
#define ENETC_SI_SITFRM1_TFRM_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITFRM1_TFRM_HIGH_SHIFT)) & ENETC_SI_SITFRM1_TFRM_HIGH_MASK)
/*! @} */

/*! @name SITUCA0 - Station interface transmit unicast frame counter (ifOutUcastPkts) 0 */
/*! @{ */

#define ENETC_SI_SITUCA0_TUCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITUCA0_TUCA_LOW_SHIFT          (0U)
#define ENETC_SI_SITUCA0_TUCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITUCA0_TUCA_LOW_SHIFT)) & ENETC_SI_SITUCA0_TUCA_LOW_MASK)
/*! @} */

/*! @name SITUCA1 - Station interface transmit unicast frame counter (ifOutUcastPkts) 1 */
/*! @{ */

#define ENETC_SI_SITUCA1_TUCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITUCA1_TUCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SITUCA1_TUCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITUCA1_TUCA_HIGH_SHIFT)) & ENETC_SI_SITUCA1_TUCA_HIGH_MASK)
/*! @} */

/*! @name SITMCA0 - Station interface transmit multicast frame counter (ifOutMulticastPkts) 0 */
/*! @{ */

#define ENETC_SI_SITMCA0_TMCA_LOW_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SITMCA0_TMCA_LOW_SHIFT          (0U)
#define ENETC_SI_SITMCA0_TMCA_LOW(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITMCA0_TMCA_LOW_SHIFT)) & ENETC_SI_SITMCA0_TMCA_LOW_MASK)
/*! @} */

/*! @name SITMCA1 - Station interface transmit multicast frame counter (ifOutMulticastPkts) 1 */
/*! @{ */

#define ENETC_SI_SITMCA1_TMCA_HIGH_MASK          (0xFFFFFFFFU)
#define ENETC_SI_SITMCA1_TMCA_HIGH_SHIFT         (0U)
#define ENETC_SI_SITMCA1_TMCA_HIGH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITMCA1_TMCA_HIGH_SHIFT)) & ENETC_SI_SITMCA1_TMCA_HIGH_MASK)
/*! @} */

/*! @name SIBLPR - Station interface boot loader parameter register 0..Station interface boot loader parameter register 1 */
/*! @{ */

#define ENETC_SI_SIBLPR_PARAM_VAL_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SIBLPR_PARAM_VAL_SHIFT          (0U)
#define ENETC_SI_SIBLPR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBLPR_PARAM_VAL_SHIFT)) & ENETC_SI_SIBLPR_PARAM_VAL_MASK)
/*! @} */

/* The count of ENETC_SI_SIBLPR */
#define ENETC_SI_SIBLPR_COUNT                    (2U)

/*! @name SICBDRMR - Station interface command BDR mode register */
/*! @{ */

#define ENETC_SI_SICBDRMR_EN_MASK                (0x80000000U)
#define ENETC_SI_SICBDRMR_EN_SHIFT               (31U)
#define ENETC_SI_SICBDRMR_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRMR_EN_SHIFT)) & ENETC_SI_SICBDRMR_EN_MASK)
/*! @} */

/*! @name SICBDRSR - Station interface command BDR status register */
/*! @{ */

#define ENETC_SI_SICBDRSR_BUSY_MASK              (0x1U)
#define ENETC_SI_SICBDRSR_BUSY_SHIFT             (0U)
#define ENETC_SI_SICBDRSR_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRSR_BUSY_SHIFT)) & ENETC_SI_SICBDRSR_BUSY_MASK)
/*! @} */

/*! @name SICBDRBAR0 - Station interface command BDR base address register 0 */
/*! @{ */

#define ENETC_SI_SICBDRBAR0_ADDRL_MASK           (0xFFFFFF80U)
#define ENETC_SI_SICBDRBAR0_ADDRL_SHIFT          (7U)
#define ENETC_SI_SICBDRBAR0_ADDRL(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRBAR0_ADDRL_SHIFT)) & ENETC_SI_SICBDRBAR0_ADDRL_MASK)
/*! @} */

/*! @name SICBDRBAR1 - Station interface command BDR base address register 1 */
/*! @{ */

#define ENETC_SI_SICBDRBAR1_ADDRH_MASK           (0xFFFFFFFFU)
#define ENETC_SI_SICBDRBAR1_ADDRH_SHIFT          (0U)
#define ENETC_SI_SICBDRBAR1_ADDRH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRBAR1_ADDRH_SHIFT)) & ENETC_SI_SICBDRBAR1_ADDRH_MASK)
/*! @} */

/*! @name SICBDRPIR - Station interface command BDR producer index register */
/*! @{ */

#define ENETC_SI_SICBDRPIR_BDR_INDEX_MASK        (0x3FFU)
#define ENETC_SI_SICBDRPIR_BDR_INDEX_SHIFT       (0U)
#define ENETC_SI_SICBDRPIR_BDR_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRPIR_BDR_INDEX_SHIFT)) & ENETC_SI_SICBDRPIR_BDR_INDEX_MASK)
/*! @} */

/*! @name SICBDRCIR - Station interface command BDR consumer index register */
/*! @{ */

#define ENETC_SI_SICBDRCIR_BDR_INDEX_MASK        (0x3FFU)
#define ENETC_SI_SICBDRCIR_BDR_INDEX_SHIFT       (0U)
#define ENETC_SI_SICBDRCIR_BDR_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRCIR_BDR_INDEX_SHIFT)) & ENETC_SI_SICBDRCIR_BDR_INDEX_MASK)
/*! @} */

/*! @name SICBDRLENR - Station interface command BDR length register */
/*! @{ */

#define ENETC_SI_SICBDRLENR_LENGTH_MASK          (0x7F8U)
#define ENETC_SI_SICBDRLENR_LENGTH_SHIFT         (3U)
#define ENETC_SI_SICBDRLENR_LENGTH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRLENR_LENGTH_SHIFT)) & ENETC_SI_SICBDRLENR_LENGTH_MASK)
/*! @} */

/*! @name SICBDRIER - Station interface command BDR interrupt enable register */
/*! @{ */

#define ENETC_SI_SICBDRIER_CBDCIE_MASK           (0x1U)
#define ENETC_SI_SICBDRIER_CBDCIE_SHIFT          (0U)
#define ENETC_SI_SICBDRIER_CBDCIE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRIER_CBDCIE_SHIFT)) & ENETC_SI_SICBDRIER_CBDCIE_MASK)
/*! @} */

/*! @name SICBDRIDR - Station interface command BDR interrupt detect register */
/*! @{ */

#define ENETC_SI_SICBDRIDR_CBDC_MASK             (0x1U)
#define ENETC_SI_SICBDRIDR_CBDC_SHIFT            (0U)
#define ENETC_SI_SICBDRIDR_CBDC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICBDRIDR_CBDC_SHIFT)) & ENETC_SI_SICBDRIDR_CBDC_MASK)
/*! @} */

/*! @name SICAPR0 - Station interface capability register 0 */
/*! @{ */

