tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SICAPR0_NUM_TX_BDR_MASK         (0xFFU)
#define ENETC_SI_SICAPR0_NUM_TX_BDR_SHIFT        (0U)
#define ENETC_SI_SICAPR0_NUM_TX_BDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR0_NUM_TX_BDR_SHIFT)) & ENETC_SI_SICAPR0_NUM_TX_BDR_MASK)

#define ENETC_SI_SICAPR0_NUM_RX_BDR_MASK         (0xFF0000U)
#define ENETC_SI_SICAPR0_NUM_RX_BDR_SHIFT        (16U)
#define ENETC_SI_SICAPR0_NUM_RX_BDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR0_NUM_RX_BDR_SHIFT)) & ENETC_SI_SICAPR0_NUM_RX_BDR_MASK)

#define ENETC_SI_SICAPR0_NUM_MAC_ADDR_MASK       (0xF0000000U)
#define ENETC_SI_SICAPR0_NUM_MAC_ADDR_SHIFT      (28U)
#define ENETC_SI_SICAPR0_NUM_MAC_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR0_NUM_MAC_ADDR_SHIFT)) & ENETC_SI_SICAPR0_NUM_MAC_ADDR_MASK)
/*! @} */

/*! @name SICAPR1 - Station interface capability register 1 */
/*! @{ */

#define ENETC_SI_SICAPR1_NUM_RX_GRP_MASK         (0xFF0000U)
#define ENETC_SI_SICAPR1_NUM_RX_GRP_SHIFT        (16U)
#define ENETC_SI_SICAPR1_NUM_RX_GRP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR1_NUM_RX_GRP_SHIFT)) & ENETC_SI_SICAPR1_NUM_RX_GRP_MASK)
/*! @} */

/*! @name SICAPR2 - Station interface capability register 2 */
/*! @{ */

#define ENETC_SI_SICAPR2_VTP_MASK                (0xFU)
#define ENETC_SI_SICAPR2_VTP_SHIFT               (0U)
#define ENETC_SI_SICAPR2_VTP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICAPR2_VTP_SHIFT)) & ENETC_SI_SICAPR2_VTP_MASK)
/*! @} */

/*! @name PSIIER - Physical station interface interrupt enable register */
/*! @{ */

#define ENETC_SI_PSIIER_MR1IE_MASK               (0x2U)
#define ENETC_SI_PSIIER_MR1IE_SHIFT              (1U)
#define ENETC_SI_PSIIER_MR1IE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIER_MR1IE_SHIFT)) & ENETC_SI_PSIIER_MR1IE_MASK)

#define ENETC_SI_PSIIER_FLR1IE_MASK              (0x20000U)
#define ENETC_SI_PSIIER_FLR1IE_SHIFT             (17U)
#define ENETC_SI_PSIIER_FLR1IE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIER_FLR1IE_SHIFT)) & ENETC_SI_PSIIER_FLR1IE_MASK)
/*! @} */

/*! @name PSIIDR - Physical station interface interrupt detect register */
/*! @{ */

#define ENETC_SI_PSIIDR_TXR_MASK                 (0x1U)
#define ENETC_SI_PSIIDR_TXR_SHIFT                (0U)
#define ENETC_SI_PSIIDR_TXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_TXR_SHIFT)) & ENETC_SI_PSIIDR_TXR_MASK)

#define ENETC_SI_PSIIDR_MR1_MASK                 (0x2U)
#define ENETC_SI_PSIIDR_MR1_SHIFT                (1U)
#define ENETC_SI_PSIIDR_MR1(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_MR1_SHIFT)) & ENETC_SI_PSIIDR_MR1_MASK)

#define ENETC_SI_PSIIDR_RXR_MASK                 (0x10000U)
#define ENETC_SI_PSIIDR_RXR_SHIFT                (16U)
#define ENETC_SI_PSIIDR_RXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_RXR_SHIFT)) & ENETC_SI_PSIIDR_RXR_MASK)

#define ENETC_SI_PSIIDR_FLR1_MASK                (0x20000U)
#define ENETC_SI_PSIIDR_FLR1_SHIFT               (17U)
#define ENETC_SI_PSIIDR_FLR1(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_PSIIDR_FLR1_SHIFT)) & ENETC_SI_PSIIDR_FLR1_MASK)
/*! @} */

/*! @name VSIIER - Virtual station interface interrupt enable register */
/*! @{ */

#define ENETC_SI_VSIIER_MSIE_MASK                (0x100U)
#define ENETC_SI_VSIIER_MSIE_SHIFT               (8U)
#define ENETC_SI_VSIIER_MSIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIER_MSIE_SHIFT)) & ENETC_SI_VSIIER_MSIE_MASK)

#define ENETC_SI_VSIIER_MRIE_MASK                (0x200U)
#define ENETC_SI_VSIIER_MRIE_SHIFT               (9U)
#define ENETC_SI_VSIIER_MRIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIER_MRIE_SHIFT)) & ENETC_SI_VSIIER_MRIE_MASK)
/*! @} */

/*! @name VSIIDR - Virtual station interface interrupt detect register */
/*! @{ */

#define ENETC_SI_VSIIDR_TXR_MASK                 (0x1U)
#define ENETC_SI_VSIIDR_TXR_SHIFT                (0U)
#define ENETC_SI_VSIIDR_TXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_TXR_SHIFT)) & ENETC_SI_VSIIDR_TXR_MASK)

#define ENETC_SI_VSIIDR_MS_MASK                  (0x100U)
#define ENETC_SI_VSIIDR_MS_SHIFT                 (8U)
#define ENETC_SI_VSIIDR_MS(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_MS_SHIFT)) & ENETC_SI_VSIIDR_MS_MASK)

#define ENETC_SI_VSIIDR_MR_MASK                  (0x200U)
#define ENETC_SI_VSIIDR_MR_SHIFT                 (9U)
#define ENETC_SI_VSIIDR_MR(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_MR_SHIFT)) & ENETC_SI_VSIIDR_MR_MASK)

#define ENETC_SI_VSIIDR_RXR_MASK                 (0x10000U)
#define ENETC_SI_VSIIDR_RXR_SHIFT                (16U)
#define ENETC_SI_VSIIDR_RXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_RXR_SHIFT)) & ENETC_SI_VSIIDR_RXR_MASK)
/*! @} */

/*! @name SITXIDR0 - Station interface transmit interrupt detect register 0 */
/*! @{ */

#define ENETC_SI_SITXIDR0_TXT0_MASK              (0x1U)
#define ENETC_SI_SITXIDR0_TXT0_SHIFT             (0U)
#define ENETC_SI_SITXIDR0_TXT0(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT0_SHIFT)) & ENETC_SI_SITXIDR0_TXT0_MASK)

#define ENETC_SI_SITXIDR0_TXT1_MASK              (0x2U)
#define ENETC_SI_SITXIDR0_TXT1_SHIFT             (1U)
#define ENETC_SI_SITXIDR0_TXT1(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT1_SHIFT)) & ENETC_SI_SITXIDR0_TXT1_MASK)

#define ENETC_SI_SITXIDR0_TXT2_MASK              (0x4U)
#define ENETC_SI_SITXIDR0_TXT2_SHIFT             (2U)
#define ENETC_SI_SITXIDR0_TXT2(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT2_SHIFT)) & ENETC_SI_SITXIDR0_TXT2_MASK)

#define ENETC_SI_SITXIDR0_TXT3_MASK              (0x8U)
#define ENETC_SI_SITXIDR0_TXT3_SHIFT             (3U)
#define ENETC_SI_SITXIDR0_TXT3(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT3_SHIFT)) & ENETC_SI_SITXIDR0_TXT3_MASK)

#define ENETC_SI_SITXIDR0_TXT4_MASK              (0x10U)
#define ENETC_SI_SITXIDR0_TXT4_SHIFT             (4U)
#define ENETC_SI_SITXIDR0_TXT4(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT4_SHIFT)) & ENETC_SI_SITXIDR0_TXT4_MASK)

