tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SITMRIDR_SYNC_MASK              (0x1U)
#define ENETC_SI_SITMRIDR_SYNC_SHIFT             (0U)
#define ENETC_SI_SITMRIDR_SYNC(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITMRIDR_SYNC_SHIFT)) & ENETC_SI_SITMRIDR_SYNC_MASK)
/*! @} */

/*! @name SITMRMSIVR - Station interface timer MSI-X vector register */
/*! @{ */

#define ENETC_SI_SITMRMSIVR_VECTOR_MASK          (0x3FU)
#define ENETC_SI_SITMRMSIVR_VECTOR_SHIFT         (0U)
#define ENETC_SI_SITMRMSIVR_VECTOR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITMRMSIVR_VECTOR_SHIFT)) & ENETC_SI_SITMRMSIVR_VECTOR_MASK)
/*! @} */

/*! @name SIMSITRVR - Station interface MSI-X transmit ring 0 vector register..Station interface MSI-X transmit ring 9 vector register */
/*! @{ */

#define ENETC_SI_SIMSITRVR_VECTOR_MASK           (0x3FU)
#define ENETC_SI_SIMSITRVR_VECTOR_SHIFT          (0U)
#define ENETC_SI_SIMSITRVR_VECTOR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMSITRVR_VECTOR_SHIFT)) & ENETC_SI_SIMSITRVR_VECTOR_MASK)
/*! @} */

/* The count of ENETC_SI_SIMSITRVR */
#define ENETC_SI_SIMSITRVR_COUNT                 (10U)

/*! @name SIMSIRRVR - Station interface MSI-X receive ring 0 vector register..Station interface MSI-X receive ring 9 vector register */
/*! @{ */

#define ENETC_SI_SIMSIRRVR_VECTOR_MASK           (0x3FU)
#define ENETC_SI_SIMSIRRVR_VECTOR_SHIFT          (0U)
#define ENETC_SI_SIMSIRRVR_VECTOR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMSIRRVR_VECTOR_SHIFT)) & ENETC_SI_SIMSIRRVR_VECTOR_MASK)
/*! @} */

/* The count of ENETC_SI_SIMSIRRVR */
#define ENETC_SI_SIMSIRRVR_COUNT                 (10U)

/*! @name SICMECR - Station interface correctable memory error configuration register */
/*! @{ */

#define ENETC_SI_SICMECR_THRESHOLD_MASK          (0xFFU)
#define ENETC_SI_SICMECR_THRESHOLD_SHIFT         (0U)
/*! THRESHOLD - Threshold */
#define ENETC_SI_SICMECR_THRESHOLD(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICMECR_THRESHOLD_SHIFT)) & ENETC_SI_SICMECR_THRESHOLD_MASK)
/*! @} */

/*! @name SICMESR - Station interface correctable memory error status register */
/*! @{ */

#define ENETC_SI_SICMESR_MEM_ID_MASK             (0x1F0000U)
#define ENETC_SI_SICMESR_MEM_ID_SHIFT            (16U)
/*! MEM_ID - Memory ID */
#define ENETC_SI_SICMESR_MEM_ID(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICMESR_MEM_ID_SHIFT)) & ENETC_SI_SICMESR_MEM_ID_MASK)

#define ENETC_SI_SICMESR_SBEE_MASK               (0x80000000U)
#define ENETC_SI_SICMESR_SBEE_SHIFT              (31U)
/*! SBEE - Single-bit ECC error */
#define ENETC_SI_SICMESR_SBEE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICMESR_SBEE_SHIFT)) & ENETC_SI_SICMESR_SBEE_MASK)
/*! @} */

/*! @name SICMECTR - Station interface correctable memory error count register */
/*! @{ */

#define ENETC_SI_SICMECTR_COUNT_MASK             (0xFFU)
#define ENETC_SI_SICMECTR_COUNT_SHIFT            (0U)
/*! COUNT - Count */
#define ENETC_SI_SICMECTR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SICMECTR_COUNT_SHIFT)) & ENETC_SI_SICMECTR_COUNT_MASK)
/*! @} */

/*! @name SIUPECR - Station interface uncorrectable programming error configuration register */
/*! @{ */

#define ENETC_SI_SIUPECR_RD_MASK                 (0x80000000U)
#define ENETC_SI_SIUPECR_RD_SHIFT                (31U)
/*! RD - Report disable */
#define ENETC_SI_SIUPECR_RD(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPECR_RD_SHIFT)) & ENETC_SI_SIUPECR_RD_MASK)
/*! @} */

/*! @name SIUPESR - Station interface uncorrectable programming error status register */
/*! @{ */

#define ENETC_SI_SIUPESR_DROP_SI_EN_MASK         (0x1U)
#define ENETC_SI_SIUPESR_DROP_SI_EN_SHIFT        (0U)
#define ENETC_SI_SIUPESR_DROP_SI_EN(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPESR_DROP_SI_EN_SHIFT)) & ENETC_SI_SIUPESR_DROP_SI_EN_MASK)

#define ENETC_SI_SIUPESR_DROP_RING_EN_MASK       (0x2U)
#define ENETC_SI_SIUPESR_DROP_RING_EN_SHIFT      (1U)
#define ENETC_SI_SIUPESR_DROP_RING_EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPESR_DROP_RING_EN_SHIFT)) & ENETC_SI_SIUPESR_DROP_RING_EN_MASK)

#define ENETC_SI_SIUPESR_DROP_RING_SEL_MASK      (0x8U)
#define ENETC_SI_SIUPESR_DROP_RING_SEL_SHIFT     (3U)
#define ENETC_SI_SIUPESR_DROP_RING_SEL(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPESR_DROP_RING_SEL_SHIFT)) & ENETC_SI_SIUPESR_DROP_RING_SEL_MASK)

#define ENETC_SI_SIUPESR_M_MASK                  (0x40000000U)
#define ENETC_SI_SIUPESR_M_SHIFT                 (30U)
/*! M - Multiple */
#define ENETC_SI_SIUPESR_M(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPESR_M_SHIFT)) & ENETC_SI_SIUPESR_M_MASK)

#define ENETC_SI_SIUPESR_PE_MASK                 (0x80000000U)
#define ENETC_SI_SIUPESR_PE_SHIFT                (31U)
/*! PE - Programming error */
#define ENETC_SI_SIUPESR_PE(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPESR_PE_SHIFT)) & ENETC_SI_SIUPESR_PE_MASK)
/*! @} */

/*! @name SIUPECTR - Station interface uncorrectable programming error count register */
/*! @{ */

#define ENETC_SI_SIUPECTR_COUNT_MASK             (0xFFFFFFFFU)
#define ENETC_SI_SIUPECTR_COUNT_SHIFT            (0U)
/*! COUNT - Count */
#define ENETC_SI_SIUPECTR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUPECTR_COUNT_SHIFT)) & ENETC_SI_SIUPECTR_COUNT_MASK)
/*! @} */

/*! @name SIUNSBECR - Station interface uncorrectable non-fatal system bus error configuration register */
/*! @{ */

#define ENETC_SI_SIUNSBECR_THRESHOLD_MASK        (0xFFU)
#define ENETC_SI_SIUNSBECR_THRESHOLD_SHIFT       (0U)
/*! THRESHOLD - Threshold */
#define ENETC_SI_SIUNSBECR_THRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIUNSBECR_THRESHOLD_SHIFT)) & ENETC_SI_SIUNSBECR_THRESHOLD_MASK)
/*! @} */

/*! @name SIUNSBESR - Station interface uncorrectable non-fatal system bus error status register */
/*! @{ */

