tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
#define ENETC_SI_SIMAFTCAPR_NUM_MAC_AFTE_MASK    (0xFFU)
#define ENETC_SI_SIMAFTCAPR_NUM_MAC_AFTE_SHIFT   (0U)
#define ENETC_SI_SIMAFTCAPR_NUM_MAC_AFTE(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMAFTCAPR_NUM_MAC_AFTE_SHIFT)) & ENETC_SI_SIMAFTCAPR_NUM_MAC_AFTE_MASK)
/*! @} */

/*! @name SIVFTCAPR - Station interface VLAN filter table capability register */
/*! @{ */

#define ENETC_SI_SIVFTCAPR_NUM_VLAN_FTE_MASK     (0xFFU)
#define ENETC_SI_SIVFTCAPR_NUM_VLAN_FTE_SHIFT    (0U)
#define ENETC_SI_SIVFTCAPR_NUM_VLAN_FTE(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVFTCAPR_NUM_VLAN_FTE_SHIFT)) & ENETC_SI_SIVFTCAPR_NUM_VLAN_FTE_MASK)
/*! @} */

/*! @name TBMR - Tx BDR 0 mode register..Tx BDR 9 mode register */
/*! @{ */

#define ENETC_SI_TBMR_PRIO_MASK                  (0x7U)
#define ENETC_SI_TBMR_PRIO_SHIFT                 (0U)
#define ENETC_SI_TBMR_PRIO(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBMR_PRIO_SHIFT)) & ENETC_SI_TBMR_PRIO_MASK)

#define ENETC_SI_TBMR_WRR_MASK                   (0x70U)
#define ENETC_SI_TBMR_WRR_SHIFT                  (4U)
#define ENETC_SI_TBMR_WRR(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBMR_WRR_SHIFT)) & ENETC_SI_TBMR_WRR_MASK)

#define ENETC_SI_TBMR_CRC_MASK                   (0x100U)
#define ENETC_SI_TBMR_CRC_SHIFT                  (8U)
#define ENETC_SI_TBMR_CRC(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBMR_CRC_SHIFT)) & ENETC_SI_TBMR_CRC_MASK)

#define ENETC_SI_TBMR_VIH_MASK                   (0x200U)
#define ENETC_SI_TBMR_VIH_SHIFT                  (9U)
#define ENETC_SI_TBMR_VIH(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBMR_VIH_SHIFT)) & ENETC_SI_TBMR_VIH_MASK)

#define ENETC_SI_TBMR_EN_MASK                    (0x80000000U)
#define ENETC_SI_TBMR_EN_SHIFT                   (31U)
#define ENETC_SI_TBMR_EN(x)                      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBMR_EN_SHIFT)) & ENETC_SI_TBMR_EN_MASK)
/*! @} */

/* The count of ENETC_SI_TBMR */
#define ENETC_SI_TBMR_COUNT                      (10U)

/*! @name TBSR - Tx BDR 0 status register..Tx BDR 9 status register */
/*! @{ */

#define ENETC_SI_TBSR_BUSY_MASK                  (0x1U)
#define ENETC_SI_TBSR_BUSY_SHIFT                 (0U)
#define ENETC_SI_TBSR_BUSY(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBSR_BUSY_SHIFT)) & ENETC_SI_TBSR_BUSY_MASK)

#define ENETC_SI_TBSR_SBE_MASK                   (0x10000U)
#define ENETC_SI_TBSR_SBE_SHIFT                  (16U)
#define ENETC_SI_TBSR_SBE(x)                     (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBSR_SBE_SHIFT)) & ENETC_SI_TBSR_SBE_MASK)
/*! @} */

/* The count of ENETC_SI_TBSR */
#define ENETC_SI_TBSR_COUNT                      (10U)

/*! @name TBBAR0 - Tx BDR 0 base address register 0..Tx BDR 9 base address register 0 */
/*! @{ */

#define ENETC_SI_TBBAR0_ADDRL_MASK               (0xFFFFFF80U)
#define ENETC_SI_TBBAR0_ADDRL_SHIFT              (7U)
#define ENETC_SI_TBBAR0_ADDRL(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBBAR0_ADDRL_SHIFT)) & ENETC_SI_TBBAR0_ADDRL_MASK)
/*! @} */

/* The count of ENETC_SI_TBBAR0 */
#define ENETC_SI_TBBAR0_COUNT                    (10U)

/*! @name TBBAR1 - Tx BDR 0 base address register 1..Tx BDR 9 base address register 1 */
/*! @{ */

#define ENETC_SI_TBBAR1_ADDRH_MASK               (0xFFFFFFFFU)
#define ENETC_SI_TBBAR1_ADDRH_SHIFT              (0U)
#define ENETC_SI_TBBAR1_ADDRH(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBBAR1_ADDRH_SHIFT)) & ENETC_SI_TBBAR1_ADDRH_MASK)
/*! @} */

/* The count of ENETC_SI_TBBAR1 */
#define ENETC_SI_TBBAR1_COUNT                    (10U)

/*! @name TBPIR - Tx BDR 0 producer index register..Tx BDR 9 producer index register */
/*! @{ */

#define ENETC_SI_TBPIR_BDR_INDEX_MASK            (0xFFFFU)
#define ENETC_SI_TBPIR_BDR_INDEX_SHIFT           (0U)
#define ENETC_SI_TBPIR_BDR_INDEX(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBPIR_BDR_INDEX_SHIFT)) & ENETC_SI_TBPIR_BDR_INDEX_MASK)
/*! @} */

/* The count of ENETC_SI_TBPIR */
#define ENETC_SI_TBPIR_COUNT                     (10U)

/*! @name TBCIR - Tx BDR 0 consumer index register..Tx BDR 9 consumer index register */
/*! @{ */

#define ENETC_SI_TBCIR_BDR_INDEX_MASK            (0xFFFFU)
#define ENETC_SI_TBCIR_BDR_INDEX_SHIFT           (0U)
#define ENETC_SI_TBCIR_BDR_INDEX(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBCIR_BDR_INDEX_SHIFT)) & ENETC_SI_TBCIR_BDR_INDEX_MASK)

#define ENETC_SI_TBCIR_STAT_ID_MASK              (0xFFFF0000U)
#define ENETC_SI_TBCIR_STAT_ID_SHIFT             (16U)
#define ENETC_SI_TBCIR_STAT_ID(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBCIR_STAT_ID_SHIFT)) & ENETC_SI_TBCIR_STAT_ID_MASK)
/*! @} */

/* The count of ENETC_SI_TBCIR */
#define ENETC_SI_TBCIR_COUNT                     (10U)

/*! @name TBLENR - Tx BDR 0 length register..Tx BDR 9 length register */
/*! @{ */

#define ENETC_SI_TBLENR_LENGTH_MASK              (0x1FFF8U)
#define ENETC_SI_TBLENR_LENGTH_SHIFT             (3U)
#define ENETC_SI_TBLENR_LENGTH(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBLENR_LENGTH_SHIFT)) & ENETC_SI_TBLENR_LENGTH_MASK)
/*! @} */

/* The count of ENETC_SI_TBLENR */
#define ENETC_SI_TBLENR_COUNT                    (10U)

/*! @name TBIER - Tx BDR 0 interrupt enable register..Tx BDR 9 interrupt enable register */
/*! @{ */

#define ENETC_SI_TBIER_TXTIE_MASK                (0x1U)
#define ENETC_SI_TBIER_TXTIE_SHIFT               (0U)
#define ENETC_SI_TBIER_TXTIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBIER_TXTIE_SHIFT)) & ENETC_SI_TBIER_TXTIE_MASK)

#define ENETC_SI_TBIER_TXFIE_MASK                (0x2U)
#define ENETC_SI_TBIER_TXFIE_SHIFT               (1U)
#define ENETC_SI_TBIER_TXFIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_TBIER_TXFIE_SHIFT)) & ENETC_SI_TBIER_TXFIE_MASK)
/*! @} */

