tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_ENETC_SI.h
/*! @name RBBAR1 - Rx BDR 0 base address register 1..Rx BDR 9 base address register 1 */
/*! @{ */

#define ENETC_SI_RBBAR1_ADDRH_MASK               (0xFFFFFFFFU)
#define ENETC_SI_RBBAR1_ADDRH_SHIFT              (0U)
#define ENETC_SI_RBBAR1_ADDRH(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBBAR1_ADDRH_SHIFT)) & ENETC_SI_RBBAR1_ADDRH_MASK)
/*! @} */

/* The count of ENETC_SI_RBBAR1 */
#define ENETC_SI_RBBAR1_COUNT                    (10U)

/*! @name RBPIR - Rx BDR 0 producer index register..Rx BDR 9 producer index register */
/*! @{ */

#define ENETC_SI_RBPIR_BDR_INDEX_MASK            (0xFFFFU)
#define ENETC_SI_RBPIR_BDR_INDEX_SHIFT           (0U)
#define ENETC_SI_RBPIR_BDR_INDEX(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBPIR_BDR_INDEX_SHIFT)) & ENETC_SI_RBPIR_BDR_INDEX_MASK)
/*! @} */

/* The count of ENETC_SI_RBPIR */
#define ENETC_SI_RBPIR_COUNT                     (10U)

/*! @name RBLENR - Rx BDR 0 length register..Rx BDR 9 length register */
/*! @{ */

#define ENETC_SI_RBLENR_LENGTH_MASK              (0x1FFF8U)
#define ENETC_SI_RBLENR_LENGTH_SHIFT             (3U)
#define ENETC_SI_RBLENR_LENGTH(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBLENR_LENGTH_SHIFT)) & ENETC_SI_RBLENR_LENGTH_MASK)
/*! @} */

/* The count of ENETC_SI_RBLENR */
#define ENETC_SI_RBLENR_COUNT                    (10U)

/*! @name RBDCR - Rx BDR 0 drop count register..Rx BDR 9 drop count register */
/*! @{ */

#define ENETC_SI_RBDCR_COUNT_MASK                (0xFFFFFFFFU)
#define ENETC_SI_RBDCR_COUNT_SHIFT               (0U)
#define ENETC_SI_RBDCR_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBDCR_COUNT_SHIFT)) & ENETC_SI_RBDCR_COUNT_MASK)
/*! @} */

/* The count of ENETC_SI_RBDCR */
#define ENETC_SI_BDR_RBDCR_COUNT                 (10U)

/*! @name RBIER - Rx BDR 0 interrupt enable register..Rx BDR 9 interrupt enable register */
/*! @{ */

#define ENETC_SI_RBIER_RXTIE_MASK                (0x1U)
#define ENETC_SI_RBIER_RXTIE_SHIFT               (0U)
#define ENETC_SI_RBIER_RXTIE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBIER_RXTIE_SHIFT)) & ENETC_SI_RBIER_RXTIE_MASK)
/*! @} */

/* The count of ENETC_SI_RBIER */
#define ENETC_SI_RBIER_COUNT                     (10U)

/*! @name RBIDR - Rx BDR 0 interrupt detect register..Rx BDR 9 interrupt detect register */
/*! @{ */

#define ENETC_SI_RBIDR_RXT_MASK                  (0x1U)
#define ENETC_SI_RBIDR_RXT_SHIFT                 (0U)
#define ENETC_SI_RBIDR_RXT(x)                    (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBIDR_RXT_SHIFT)) & ENETC_SI_RBIDR_RXT_MASK)
/*! @} */

/* The count of ENETC_SI_RBIDR */
#define ENETC_SI_RBIDR_COUNT                     (10U)

/*! @name RBICR0 - Rx BDR 0 interrupt coalescing register 0..Rx BDR 9 interrupt coalescing register 0 */
/*! @{ */

#define ENETC_SI_RBICR0_ICPT_MASK                (0x1FFU)
#define ENETC_SI_RBICR0_ICPT_SHIFT               (0U)
#define ENETC_SI_RBICR0_ICPT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBICR0_ICPT_SHIFT)) & ENETC_SI_RBICR0_ICPT_MASK)

#define ENETC_SI_RBICR0_ICEN_MASK                (0x80000000U)
#define ENETC_SI_RBICR0_ICEN_SHIFT               (31U)
#define ENETC_SI_RBICR0_ICEN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBICR0_ICEN_SHIFT)) & ENETC_SI_RBICR0_ICEN_MASK)
/*! @} */

/* The count of ENETC_SI_RBICR0 */
#define ENETC_SI_RBICR0_COUNT                    (10U)

/*! @name RBICR1 - Rx BDR 0 interrupt coalescing register 1..Rx BDR 9 interrupt coalescing register 1 */
/*! @{ */

#define ENETC_SI_RBICR1_ICTT_MASK                (0xFFFFFFFFU)
#define ENETC_SI_RBICR1_ICTT_SHIFT               (0U)
#define ENETC_SI_RBICR1_ICTT(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_SI_RBICR1_ICTT_SHIFT)) & ENETC_SI_RBICR1_ICTT_MASK)
/*! @} */

/* The count of ENETC_SI_RBICR1 */
#define ENETC_SI_RBICR1_COUNT                    (10U)


/*!
 * @}
 */ /* end of group ENETC_SI_Register_Masks */


/*!
 * @}
 */ /* end of group ENETC_SI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ENETC_SI_H_ */

